app/views/natparks/show.html.erb


    <% @natpark.travellers.each do |traveller| %>
---
SELECT "travellers".* FROM "travellers"

  <p>Reviews: </p>
  <% @natpark.reviews.each do |review| %>
---
SELECT "reviews".* FROM "reviews"

        <% @traveller_id= review.traveller_id %>
        <% @username=Account.find_by(traveller_id: @traveller_id) %>
---
SELECT  "accounts".* FROM "accounts" WHERE "accounts"."traveller_id" = ? LIMIT ?  [["traveller_id", 7], ["LIMIT", 1]]