app/controllers/application_controller.rb

SELECT "natparks".* FROM "natparks"
---
def about
  @natparks = Natpark.all