app/controllers/natparks_controller.rb

  def index
    @natparks = Natpark.all
---
SELECT "natparks".* FROM "natparks"

  def show
     @natpark = Natpark.find(params[:id])
     @reviews = Review.select{|review| review.natpark_id == @natpark.id}
     @account = Account.all
---
SELECT  "natparks".* FROM "natparks" WHERE "natparks"."id" = ? LIMIT ?  [["id", 1], ["LIMIT", 1]]
SELECT  "natparks".* FROM "natparks" ORDER BY "natparks"."id" ASC LIMIT ?  [["LIMIT", 1]]
SELECT  "reviews".* FROM "reviews" WHERE "reviews"."id" = ? LIMIT ?  [["id", 9], ["LIMIT", 1]]
SELECT "accounts".* FROM "accounts"