app/controllers/registrations_controller.rb

INSERT INTO "travellers" ("created_at", "updated_at") VALUES (?, ?)  [["created_at", 2017-05-22 18:07:54 UTC], ["updated_at", 2017-05-22 18:07:54 UTC]]
INSERT INTO "accounts" ("username", "password_digest", "created_at", "updated_at") VALUES (?, ?, ?, ?)  [["username", "joe"], ["password_digest", "$2a$10$LCzy8RUSz3bxdXZP.HJlgegkEQJWf7DgLh0xmIagBjFbmA2jKuYTy"], ["created_at", 2017-05-22 17:08:30 UTC], ["updated_at", 2017-05-22 17:08:30 UTC]]
---
  def create
      account = Account.new(account_params)
      @traveller=Traveller.create
      account.traveller_id = @traveller.id
      account.save