app/controllers/reviews_controller.rb

  def create

      # if the request was an ajax request (google rails respond_to)
      # save the review to the db (normal)
      # send back json representation of the review object
      # in the js code, in the success callback, we'll recieve that jsopn as a response
      #  append that data to the page
      @review = Review.create(review_params)
      @natpark = Natpark.find(@review.natpark_id)
---
INSERT INTO "reviews" ("title", "comment", "natpark_id", "traveller_id", "created_at", "updated_at") VALUES (?, ?, ?, ?, ?, ?)  [["title", "just"], ["comment", "something"], ["natpark_id", 3], ["traveller_id", 1], ["created_at", 2017-05-18 15:21:25 UTC], ["updated_at", 2017-05-18 15:21:25 UTC]]
SELECT  "natparks".* FROM "natparks" WHERE "natparks"."id" = ? LIMIT ?  [["id", 1], ["LIMIT", 1]]

  def edit

        @review = Review.find(params[:id])

        @natpark= Natpark.find(@review.natpark_id)
---
SELECT  "reviews".* FROM "reviews" WHERE "reviews"."id" = ? LIMIT ?  [["id", 5], ["LIMIT", 1]]
SELECT  "natparks".* FROM "natparks" WHERE "natparks"."id" = ? LIMIT ?  [["id", 3], ["LIMIT", 1]]

  def update
      @review=Review.find(params[:id])
      @review.update(title: params[:review][:title], comment: params[:review][:comment])
      @natpark = Natpark.find(@review.natpark_id)
---
SELECT  "reviews".* FROM "reviews" WHERE "reviews"."id" = ? LIMIT ?  [["id", 5], ["LIMIT", 1]]
UPDATE "reviews" SET "title" = ?, "comment" = ?, "updated_at" = ? WHERE "reviews"."id" = ?  [["title", nil], ["comment", nil], ["updated_at", 2017-05-22 02:26:09 UTC], ["id", 5]]
SELECT  "natparks".* FROM "natparks" WHERE "natparks"."id" = ? LIMIT ?  [["id", 3], ["LIMIT", 1]]

  def destroy
    @review = Review.find(params[:id]).destroy
    @natpark = Natpark.find(@review.natpark_id)
---
DELETE FROM "reviews" WHERE "reviews"."id" = ?  [["id", 1]]
SELECT  "reviews".* FROM "reviews" WHERE "reviews"."id" = ? LIMIT ?  [["id", 3], ["LIMIT", 1]]
SELECT  "natparks".* FROM "natparks" WHERE "natparks"."id" = ? LIMIT ?  [["id", 1], ["LIMIT", 1]]