app/controllers/travellers_controller.rb

def index
  @travellers= Traveller.all
---
SELECT "travellers".* FROM "travellers"